<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dsekt-infra","backend":"49c6c922e6832dc8c720d37cec0ff1ce28d68f3baa8661e70110190299383c64","plan_job_ref":"Job Create OpenTofu plan #51 at https://github.com/datasektionen/infra/actions/runs/12826673824","plan_out_hash":"716f856bd19f87bfbb6a19e31cf016ae20115c7c04dc41de9018fd8d02cfe471","plan_hash":"aadc0c696e0ed6d00498d80fddf3df640a2a15252e61c09899c2a33dc4d17552","plan_text_format":"diff","version":"1.44.0"} -->
OpenTofu plan for __dsekt-infra__
<details>
<summary>Plan: 21 to add, 0 to change, 21 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

OpenTofu will perform the following actions:

  # github_actions_secret.nomad_deploy_token["aaallt2"] will be created
+   resource "github_actions_secret" "nomad_deploy_token" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "aaallt2"
+       secret_name     = "NOMAD_TOKEN"
+       updated_at      = (known after apply)
    }

  # github_actions_secret.nomad_deploy_token["aurora"] will be created
+   resource "github_actions_secret" "nomad_deploy_token" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "aurora"
+       secret_name     = "NOMAD_TOKEN"
+       updated_at      = (known after apply)
    }

  # github_actions_secret.nomad_deploy_token["bawang"] will be created
+   resource "github_actions_secret" "nomad_deploy_token" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "bawang"
+       secret_name     = "NOMAD_TOKEN"
+       updated_at      = (known after apply)
    }

  # github_actions_secret.nomad_deploy_token["calypso"] will be created
+   resource "github_actions_secret" "nomad_deploy_token" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "calypso"
+       secret_name     = "NOMAD_TOKEN"
+       updated_at      = (known after apply)
    }

  # github_actions_secret.nomad_deploy_token["dbuggen"] will be created
+   resource "github_actions_secret" "nomad_deploy_token" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "dbuggen"
+       secret_name     = "NOMAD_TOKEN"
+       updated_at      = (known after apply)
    }

  # github_actions_secret.nomad_deploy_token["dfunkt"] will be created
+   resource "github_actions_secret" "nomad_deploy_token" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "dfunkt"
+       secret_name     = "NOMAD_TOKEN"
+       updated_at      = (known after apply)
    }

  # github_actions_secret.nomad_deploy_token["methone"] will be created
+   resource "github_actions_secret" "nomad_deploy_token" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "methone"
+       secret_name     = "NOMAD_TOKEN"
+       updated_at      = (known after apply)
    }

  # github_actions_secret.nomad_deploy_token["pls"] will be created
+   resource "github_actions_secret" "nomad_deploy_token" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "pls"
+       secret_name     = "NOMAD_TOKEN"
+       updated_at      = (known after apply)
    }

  # github_actions_secret.nomad_deploy_token["skywhale"] will be created
+   resource "github_actions_secret" "nomad_deploy_token" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "skywhale"
+       secret_name     = "NOMAD_TOKEN"
+       updated_at      = (known after apply)
    }

  # github_actions_secret.nomad_deploy_token["smingo"] will be created
+   resource "github_actions_secret" "nomad_deploy_token" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "smingo"
+       secret_name     = "NOMAD_TOKEN"
+       updated_at      = (known after apply)
    }

  # github_actions_secret.nomad_deploy_token["sso"] will be created
+   resource "github_actions_secret" "nomad_deploy_token" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "sso"
+       secret_name     = "NOMAD_TOKEN"
+       updated_at      = (known after apply)
    }

  # github_actions_secret.nomad_deploy_token["ston"] will be created
+   resource "github_actions_secret" "nomad_deploy_token" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "ston"
+       secret_name     = "NOMAD_TOKEN"
+       updated_at      = (known after apply)
    }

  # github_actions_secret.nomad_deploy_token["styrdokument_bawang"] will be created
+   resource "github_actions_secret" "nomad_deploy_token" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "styrdokument_bawang"
+       secret_name     = "NOMAD_TOKEN"
+       updated_at      = (known after apply)
    }

  # github_actions_secret.nomad_deploy_token["taitan"] will be created
+   resource "github_actions_secret" "nomad_deploy_token" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "taitan"
+       secret_name     = "NOMAD_TOKEN"
+       updated_at      = (known after apply)
    }

  # github_actions_secret.nomad_deploy_token["wookieleaks"] will be created
+   resource "github_actions_secret" "nomad_deploy_token" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "wookieleaks"
+       secret_name     = "NOMAD_TOKEN"
+       updated_at      = (known after apply)
    }

  # github_actions_secret.nomad_deploy_token["yoggi"] will be created
+   resource "github_actions_secret" "nomad_deploy_token" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "yoggi"
+       secret_name     = "NOMAD_TOKEN"
+       updated_at      = (known after apply)
    }

  # github_actions_secret.nomad_deploy_token["zfinger"] will be created
+   resource "github_actions_secret" "nomad_deploy_token" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "zfinger"
+       secret_name     = "NOMAD_TOKEN"
+       updated_at      = (known after apply)
    }

  # github_actions_secret.nomad_token_aaallt2 will be destroyed
  # (because github_actions_secret.nomad_token_aaallt2 is not in configuration)
-   resource "github_actions_secret" "nomad_token_aaallt2" {
-       created_at      = "2024-05-24 14:40:31 +0000 UTC" -> null
-       id              = "aaallt2:NOMAD_TOKEN" -> null
-       plaintext_value = (sensitive value) -> null
-       repository      = "aaallt2" -> null
-       secret_name     = "NOMAD_TOKEN" -> null
-       updated_at      = "2024-05-24 14:40:31 +0000 UTC" -> null
    }

  # github_actions_secret.nomad_token_aurora will be destroyed
  # (because github_actions_secret.nomad_token_aurora is not in configuration)
-   resource "github_actions_secret" "nomad_token_aurora" {
-       created_at      = "2024-11-24 16:36:38 +0000 UTC" -> null
-       id              = "aurora:NOMAD_TOKEN" -> null
-       plaintext_value = (sensitive value) -> null
-       repository      = "aurora" -> null
-       secret_name     = "NOMAD_TOKEN" -> null
-       updated_at      = "2024-11-24 16:36:38 +0000 UTC" -> null
    }

  # github_actions_secret.nomad_token_bawang will be destroyed
  # (because github_actions_secret.nomad_token_bawang is not in configuration)
-   resource "github_actions_secret" "nomad_token_bawang" {
-       created_at      = "2024-05-24 21:02:30 +0000 UTC" -> null
-       id              = "bawang:NOMAD_TOKEN" -> null
-       plaintext_value = (sensitive value) -> null
-       repository      = "bawang" -> null
-       secret_name     = "NOMAD_TOKEN" -> null
-       updated_at      = "2024-05-24 21:02:30 +0000 UTC" -> null
    }

  # github_actions_secret.nomad_token_calypso will be destroyed
  # (because github_actions_secret.nomad_token_calypso is not in configuration)
-   resource "github_actions_secret" "nomad_token_calypso" {
-       created_at      = "2024-05-26 14:23:42 +0000 UTC" -> null
-       id              = "calypso:NOMAD_TOKEN" -> null
-       plaintext_value = (sensitive value) -> null
-       repository      = "calypso" -> null
-       secret_name     = "NOMAD_TOKEN" -> null
-       updated_at      = "2024-05-26 14:23:42 +0000 UTC" -> null
    }

  # github_actions_secret.nomad_token_dbuggen will be destroyed
  # (because github_actions_secret.nomad_token_dbuggen is not in configuration)
-   resource "github_actions_secret" "nomad_token_dbuggen" {
-       created_at      = "2024-11-21 17:55:55 +0000 UTC" -> null
-       id              = "dbuggen:NOMAD_TOKEN" -> null
-       plaintext_value = (sensitive value) -> null
-       repository      = "dbuggen" -> null
-       secret_name     = "NOMAD_TOKEN" -> null
-       updated_at      = "2024-11-21 17:55:55 +0000 UTC" -> null
    }

  # github_actions_secret.nomad_token_dfunkt will be destroyed
  # (because github_actions_secret.nomad_token_dfunkt is not in configuration)
-   resource "github_actions_secret" "nomad_token_dfunkt" {
-       created_at      = "2024-05-25 22:15:25 +0000 UTC" -> null
-       id              = "dfunkt:NOMAD_TOKEN" -> null
-       plaintext_value = (sensitive value) -> null
-       repository      = "dfunkt" -> null
-       secret_name     = "NOMAD_TOKEN" -> null
-       updated_at      = "2024-05-25 22:15:25 +0000 UTC" -> null
    }

  # github_actions_secret.nomad_token_methone will be destroyed
  # (because github_actions_secret.nomad_token_methone is not in configuration)
-   resource "github_actions_secret" "nomad_token_methone" {
-       created_at      = "2024-11-24 20:09:30 +0000 UTC" -> null
-       id              = "methone:NOMAD_TOKEN" -> null
-       plaintext_value = (sensitive value) -> null
-       repository      = "methone" -> null
-       secret_name     = "NOMAD_TOKEN" -> null
-       updated_at      = "2024-11-24 20:09:30 +0000 UTC" -> null
    }

  # github_actions_secret.nomad_token_pls will be destroyed
  # (because github_actions_secret.nomad_token_pls is not in configuration)
-   resource "github_actions_secret" "nomad_token_pls" {
-       created_at      = "2024-10-16 00:10:43 +0000 UTC" -> null
-       id              = "pls:NOMAD_TOKEN" -> null
-       plaintext_value = (sensitive value) -> null
-       repository      = "pls" -> null
-       secret_name     = "NOMAD_TOKEN" -> null
-       updated_at      = "2024-10-16 00:10:43 +0000 UTC" -> null
    }

  # github_actions_secret.nomad_token_skywhale will be destroyed
  # (because github_actions_secret.nomad_token_skywhale is not in configuration)
-   resource "github_actions_secret" "nomad_token_skywhale" {
-       created_at      = "2024-09-04 19:34:59 +0000 UTC" -> null
-       id              = "skywhale:NOMAD_TOKEN" -> null
-       plaintext_value = (sensitive value) -> null
-       repository      = "skywhale" -> null
-       secret_name     = "NOMAD_TOKEN" -> null
-       updated_at      = "2024-09-04 19:34:59 +0000 UTC" -> null
    }

  # github_actions_secret.nomad_token_smingo will be destroyed
  # (because github_actions_secret.nomad_token_smingo is not in configuration)
-   resource "github_actions_secret" "nomad_token_smingo" {
-       created_at      = "2024-12-06 22:48:46 +0000 UTC" -> null
-       id              = "smingo:NOMAD_TOKEN" -> null
-       plaintext_value = (sensitive value) -> null
-       repository      = "smingo" -> null
-       secret_name     = "NOMAD_TOKEN" -> null
-       updated_at      = "2024-12-06 22:48:46 +0000 UTC" -> null
    }

  # github_actions_secret.nomad_token_sso will be destroyed
  # (because github_actions_secret.nomad_token_sso is not in configuration)
-   resource "github_actions_secret" "nomad_token_sso" {
-       created_at      = "2024-12-06 22:46:47 +0000 UTC" -> null
-       id              = "sso:NOMAD_TOKEN" -> null
-       plaintext_value = (sensitive value) -> null
-       repository      = "sso" -> null
-       secret_name     = "NOMAD_TOKEN" -> null
-       updated_at      = "2024-12-06 22:46:47 +0000 UTC" -> null
    }

  # github_actions_secret.nomad_token_ston will be destroyed
  # (because github_actions_secret.nomad_token_ston is not in configuration)
-   resource "github_actions_secret" "nomad_token_ston" {
-       created_at      = "2024-11-24 18:46:14 +0000 UTC" -> null
-       id              = "ston:NOMAD_TOKEN" -> null
-       plaintext_value = (sensitive value) -> null
-       repository      = "ston" -> null
-       secret_name     = "NOMAD_TOKEN" -> null
-       updated_at      = "2024-11-24 18:46:14 +0000 UTC" -> null
    }

  # github_actions_secret.nomad_token_styrdokument_bawang will be destroyed
  # (because github_actions_secret.nomad_token_styrdokument_bawang is not in configuration)
-   resource "github_actions_secret" "nomad_token_styrdokument_bawang" {
-       created_at      = "2024-05-26 13:42:57 +0000 UTC" -> null
-       id              = "styrdokument-bawang:NOMAD_TOKEN" -> null
-       plaintext_value = (sensitive value) -> null
-       repository      = "styrdokument-bawang" -> null
-       secret_name     = "NOMAD_TOKEN" -> null
-       updated_at      = "2024-05-26 13:42:57 +0000 UTC" -> null
    }

  # github_actions_secret.nomad_token_taitan will be destroyed
  # (because github_actions_secret.nomad_token_taitan is not in configuration)
-   resource "github_actions_secret" "nomad_token_taitan" {
-       created_at      = "2024-05-24 14:54:02 +0000 UTC" -> null
-       id              = "taitan:NOMAD_TOKEN" -> null
-       plaintext_value = (sensitive value) -> null
-       repository      = "taitan" -> null
-       secret_name     = "NOMAD_TOKEN" -> null
-       updated_at      = "2024-05-24 14:54:02 +0000 UTC" -> null
    }

  # github_actions_secret.nomad_token_wookieleaks will be destroyed
  # (because github_actions_secret.nomad_token_wookieleaks is not in configuration)
-   resource "github_actions_secret" "nomad_token_wookieleaks" {
-       created_at      = "2024-11-22 15:55:49 +0000 UTC" -> null
-       id              = "wookieleaks:NOMAD_TOKEN" -> null
-       plaintext_value = (sensitive value) -> null
-       repository      = "wookieleaks" -> null
-       secret_name     = "NOMAD_TOKEN" -> null
-       updated_at      = "2024-11-22 15:55:49 +0000 UTC" -> null
    }

  # github_actions_secret.nomad_token_yoggi will be destroyed
  # (because github_actions_secret.nomad_token_yoggi is not in configuration)
-   resource "github_actions_secret" "nomad_token_yoggi" {
-       created_at      = "2024-11-24 15:41:03 +0000 UTC" -> null
-       id              = "yoggi:NOMAD_TOKEN" -> null
-       plaintext_value = (sensitive value) -> null
-       repository      = "yoggi" -> null
-       secret_name     = "NOMAD_TOKEN" -> null
-       updated_at      = "2024-11-24 15:41:03 +0000 UTC" -> null
    }

  # github_actions_secret.nomad_token_zfinger will be destroyed
  # (because github_actions_secret.nomad_token_zfinger is not in configuration)
-   resource "github_actions_secret" "nomad_token_zfinger" {
-       created_at      = "2024-11-23 20:21:28 +0000 UTC" -> null
-       id              = "zfinger:NOMAD_TOKEN" -> null
-       plaintext_value = (sensitive value) -> null
-       repository      = "zfinger" -> null
-       secret_name     = "NOMAD_TOKEN" -> null
-       updated_at      = "2024-11-23 20:21:28 +0000 UTC" -> null
    }

  # nomad_acl_policy.deploy["auth"] will be created
+   resource "nomad_acl_policy" "deploy" {
+       id        = (known after apply)
+       name      = "deploy-auth"
+       rules_hcl = <<-EOT
            namespace "auth" {
                  capabilities = ["read-job", "submit-job"]
                }
        EOT
    }

  # nomad_acl_policy.deploy["default"] will be created
+   resource "nomad_acl_policy" "deploy" {
+       id        = (known after apply)
+       name      = "deploy-default"
+       rules_hcl = <<-EOT
            namespace "default" {
                  capabilities = ["read-job", "submit-job"]
                }
        EOT
    }

  # nomad_acl_policy.deploy_auth will be destroyed
  # (because nomad_acl_policy.deploy_auth is not in configuration)
-   resource "nomad_acl_policy" "deploy_auth" {
-       id        = "deploy-auth" -> null
-       name      = "deploy-auth" -> null
-       rules_hcl = <<-EOT
            namespace "auth" {
                  capabilities = ["read-job", "submit-job"]
                }
        EOT -> null
    }

  # nomad_acl_policy.deploy_default will be destroyed
  # (because nomad_acl_policy.deploy_default is not in configuration)
-   resource "nomad_acl_policy" "deploy_default" {
-       id        = "deploy-default" -> null
-       name      = "deploy-default" -> null
-       rules_hcl = <<-EOT
            namespace "default" {
                  capabilities = ["read-job", "submit-job"]
                }
        EOT -> null
    }

  # nomad_acl_token.deploy["auth"] will be created
+   resource "nomad_acl_token" "deploy" {
+       accessor_id     = (known after apply)
+       create_time     = (known after apply)
+       expiration_time = (known after apply)
+       expiration_ttl  = "0s"
+       global          = false
+       id              = (known after apply)
+       name            = "deploy-auth"
+       policies        = [
+           "deploy-auth",
        ]
+       secret_id       = (sensitive value)
+       type            = "client"
    }

  # nomad_acl_token.deploy["default"] will be created
+   resource "nomad_acl_token" "deploy" {
+       accessor_id     = (known after apply)
+       create_time     = (known after apply)
+       expiration_time = (known after apply)
+       expiration_ttl  = "0s"
+       global          = false
+       id              = (known after apply)
+       name            = "deploy-default"
+       policies        = [
+           "deploy-default",
        ]
+       secret_id       = (sensitive value)
+       type            = "client"
    }

  # nomad_acl_token.deploy_auth will be destroyed
  # (because nomad_acl_token.deploy_auth is not in configuration)
-   resource "nomad_acl_token" "deploy_auth" {
-       accessor_id    = "7bcfc611-547f-96f9-ba03-2d2c72575703" -> null
-       create_time    = "2024-05-25 22:15:24.293970625 +0000 UTC" -> null
-       expiration_ttl = "0s" -> null
-       global         = false -> null
-       id             = "7bcfc611-547f-96f9-ba03-2d2c72575703" -> null
-       name           = "deploy-auth" -> null
-       policies       = [
-           "deploy-auth",
        ] -> null
-       secret_id      = (sensitive value) -> null
-       type           = "client" -> null
    }

  # nomad_acl_token.deploy_default will be destroyed
  # (because nomad_acl_token.deploy_default is not in configuration)
-   resource "nomad_acl_token" "deploy_default" {
-       accessor_id    = "8da24360-42fa-32c8-957e-6be0bfc2bd2d" -> null
-       create_time    = "2024-05-24 14:40:29.480153158 +0000 UTC" -> null
-       expiration_ttl = "0s" -> null
-       global         = false -> null
-       id             = "8da24360-42fa-32c8-957e-6be0bfc2bd2d" -> null
-       name           = "deploy-default" -> null
-       policies       = [
-           "deploy-default",
        ] -> null
-       secret_id      = (sensitive value) -> null
-       type           = "client" -> null
    }

Plan: 21 to add, 0 to change, 21 to destroy.
```
</details>

:memo: Plan generated in [Create OpenTofu plan #51](https://github.com/datasektionen/infra/actions/runs/12826673824)